DWARF for kernel/c/memory.c
DIE    0: DW_TAG_compile_unit (0x7f1456ec7dc0)
  abbrev id: 0 offset: 0 mark: 0
  DW_AT_producer: "GNU C17 11.2.0 -mtune=generic -march=pentiumpro -g -O0 -ffreestanding -fno-omit-frame-pointer"
  DW_AT_language: 29
  DW_AT_name: "kernel/c/memory.c"
  DW_AT_comp_dir: "/usr/local/osdev/versions/v"
    DIE    0: DW_TAG_base_type (0x7f1456f79960)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_encoding: 5
      DW_AT_name: "long int"
    DIE    0: DW_TAG_typedef (0x7f1456f79a00)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "size_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/libcvv/include/_types/_size_t.h" (0)
      DW_AT_decl_line: 4
      DW_AT_decl_column: 23
      DW_AT_type: die -> 0 (0x7f1456f79a50)
    DIE    0: DW_TAG_base_type (0x7f1456f79a50)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_encoding: 7
      DW_AT_name: "long unsigned int"
    DIE    0: DW_TAG_base_type (0x7f1456f79cd0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 12
      DW_AT_encoding: 4
      DW_AT_name: "long double"
    DIE    0: DW_TAG_base_type (0x7f1456f79dc0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 2
      DW_AT_encoding: 5
      DW_AT_name: "short int"
    DIE    0: DW_TAG_base_type (0x7f1456f79eb0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_encoding: 5
      DW_AT_name: "int"
    DIE    0: DW_TAG_base_type (0x7f1456f79fa0)

    DIE    0: DW_TAG_typedef (0x7f1456fc84b0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "page_directory_entry"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/memory.h" (0)
      DW_AT_decl_line: 66
      DW_AT_decl_column: 3
      DW_AT_type: die -> 0 (0x7f1456fc8140)
    DIE    0: DW_TAG_pointer_type (0x7f1456ff8c80)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_type: die -> 0 (0x7f1456f8b230)
    DIE    0: DW_TAG_pointer_type (0x7f1456ff8f50)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
    DIE    0: DW_TAG_restrict_type (0x7f145705aa00)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7f1456ff8f50)
    DIE    0: DW_TAG_pointer_type (0x7f1456fff1e0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_type: die -> 0 (0x7f1456fc84b0)
    DIE    0: DW_TAG_enumeration_type (0x7f14570064b0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "sys"
      DW_AT_encoding: 7
      DW_AT_byte_size: 4
      DW_AT_type: die -> 0 (0x7f1456f8b280)
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/debug.h" (0)
      DW_AT_decl_line: 18
      DW_AT_decl_column: 6
        DIE    0: DW_TAG_enumerator (0x7f1457006500)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_system"
          DW_AT_const_value: 0
        DIE    0: DW_TAG_enumerator (0x7f1457006550)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_kernel"
          DW_AT_const_value: 1
        DIE    0: DW_TAG_enumerator (0x7f14570065a0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_intel8254"
          DW_AT_const_value: 2
        DIE    0: DW_TAG_enumerator (0x7f14570065f0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_memory"
          DW_AT_const_value: 3
        DIE    0: DW_TAG_enumerator (0x7f1457006640)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_pci"
          DW_AT_const_value: 4
        DIE    0: DW_TAG_enumerator (0x7f1457006690)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_interrupt"
          DW_AT_const_value: 5
        DIE    0: DW_TAG_enumerator (0x7f14570066e0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_paging"
          DW_AT_const_value: 6
        DIE    0: DW_TAG_enumerator (0x7f1457006730)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "sys_elf"
          DW_AT_const_value: 7
    DIE    0: DW_TAG_array_type (0x7f14570067d0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7f1457006870)
        DIE    0: DW_TAG_subrange_type (0x7f1457006820)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f1456f79a50)
          DW_AT_upper_bound: 7
    DIE    0: DW_TAG_pointer_type (0x7f1457006870)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_type: die -> 0 (0x7f14570068c0)
    DIE    0: DW_TAG_variable (0x7f1457006910)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "sys_text"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/debug.h" (0)
      DW_AT_decl_line: 29
      DW_AT_decl_column: 21
      DW_AT_type: die -> 0 (0x7f14570067d0)
      DW_AT_location: location descriptor:
        (0x7f1457065910) DW_OP_addr address, 0

    DIE    0: DW_TAG_array_type (0x7f14570069b0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7f1457006870)
        DIE    0: DW_TAG_subrange_type (0x7f1457006a00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f1456f79a50)
          DW_AT_upper_bound: 15
    DIE    0: DW_TAG_variable (0x7f1457006a50)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "bit_array"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/debug.h" (0)
      DW_AT_decl_line: 40
      DW_AT_decl_column: 21
      DW_AT_type: die -> 0 (0x7f14570069b0)
      DW_AT_location: location descriptor:
        (0x7f14570780a0) DW_OP_addr address, 0

    DIE    0: DW_TAG_pointer_type (0x7f1457006be0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_type: die -> 0 (0x7f1456fa4c30)
    DIE    0: DW_TAG_typedef (0x7f145700eb90)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_uint8_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 94
      DW_AT_decl_column: 23
      DW_AT_type: die -> 0 (0x7f1456f8b460)
    DIE    0: DW_TAG_typedef (0x7f145700ec30)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_uint16_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 95
      DW_AT_decl_column: 24
      DW_AT_type: die -> 0 (0x7f1456f8b190)
    DIE    0: DW_TAG_typedef (0x7f145700ecd0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_uint32_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 96
      DW_AT_decl_column: 22
      DW_AT_type: die -> 0 (0x7f1456f8b280)
    DIE    0: DW_TAG_typedef (0x7f145700ed70)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_uint64_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 97
      DW_AT_decl_column: 28
      DW_AT_type: die -> 0 (0x7f1456f8b370)
    DIE    0: DW_TAG_structure_type (0x7f1457014640)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_aout_symbol_table"
      DW_AT_byte_size: 16
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 125
      DW_AT_decl_column: 8
        DIE    0: DW_TAG_member (0x7f1457014690)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "tabsize"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 127
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f14570146e0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "strsize"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 128
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 4
        DIE    0: DW_TAG_member (0x7f1457014730)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 129
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 8
        DIE    0: DW_TAG_member (0x7f1457014780)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "reserved"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 130
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 12
    DIE    0: DW_TAG_typedef (0x7f1457014820)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_aout_symbol_table_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 132
      DW_AT_decl_column: 44
      DW_AT_type: die -> 0 (0x7f1457014640)
    DIE    0: DW_TAG_structure_type (0x7f1457014910)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_elf_section_header_table"
      DW_AT_byte_size: 16
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 135
      DW_AT_decl_column: 8
        DIE    0: DW_TAG_member (0x7f1457014960)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "num"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 137
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f14570149b0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "size"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 138
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 4
        DIE    0: DW_TAG_member (0x7f1457014a00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 139
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 8
        DIE    0: DW_TAG_member (0x7f1457014a50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "shndx"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 140
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 12
    DIE    0: DW_TAG_typedef (0x7f1457014af0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_elf_section_header_table_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 142
      DW_AT_decl_column: 51
      DW_AT_type: die -> 0 (0x7f1457014910)
    DIE    0: DW_TAG_union_type (0x7f1457014e60)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 16
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 163
      DW_AT_decl_column: 3
        DIE    0: DW_TAG_member (0x7f1457014eb0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "aout_sym"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 165
          DW_AT_decl_column: 35
          DW_AT_type: die -> 0 (0x7f1457014820)
        DIE    0: DW_TAG_member (0x7f1457014f00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "elf_sec"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 166
          DW_AT_decl_column: 42
          DW_AT_type: die -> 0 (0x7f1457014af0)
    DIE    0: DW_TAG_structure_type (0x7f145701b5f0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 205
      DW_AT_decl_column: 5
        DIE    0: DW_TAG_member (0x7f145701b640)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_palette_addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 207
          DW_AT_decl_column: 26
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f145701b690)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_palette_num_colors"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 208
          DW_AT_decl_column: 26
          DW_AT_type: die -> 0 (0x7f145700ec30)
          DW_AT_data_member_location: 4
    DIE    0: DW_TAG_structure_type (0x7f145701b8c0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 6
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 210
      DW_AT_decl_column: 5
        DIE    0: DW_TAG_member (0x7f145701b910)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_red_field_position"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 212
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f145701b960)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_red_mask_size"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 213
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 1
        DIE    0: DW_TAG_member (0x7f145701b9b0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_green_field_position"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 214
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 2
        DIE    0: DW_TAG_member (0x7f145701ba00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_green_mask_size"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 215
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 3
        DIE    0: DW_TAG_member (0x7f145701ba50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_blue_field_position"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 216
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 4
        DIE    0: DW_TAG_member (0x7f145701baa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_blue_mask_size"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 217
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 5
    DIE    0: DW_TAG_union_type (0x7f145701baf0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 203
      DW_AT_decl_column: 3
        DIE    0: DW_TAG_member (0x7f145701bb40)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f145701b5f0)
        DIE    0: DW_TAG_member (0x7f145701bb90)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f145701b8c0)
    DIE    0: DW_TAG_structure_type (0x7f145701bbe0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_info"
      DW_AT_byte_size: 120
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 144
      DW_AT_decl_column: 8
        DIE    0: DW_TAG_member (0x7f145701bc30)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "flags"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 147
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f145701bc80)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mem_lower"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 150
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 4
        DIE    0: DW_TAG_member (0x7f145701bcd0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mem_upper"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 151
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 8
        DIE    0: DW_TAG_member (0x7f145701bd20)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "boot_device"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 154
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 12
        DIE    0: DW_TAG_member (0x7f145701bd70)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "cmdline"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 157
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 16
        DIE    0: DW_TAG_member (0x7f145701bdc0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mods_count"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 160
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 20
        DIE    0: DW_TAG_member (0x7f145701be10)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mods_addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 161
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 24
        DIE    0: DW_TAG_member (0x7f145701be60)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "u"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 167
          DW_AT_decl_column: 5
          DW_AT_type: die -> 0 (0x7f1457014e60)
          DW_AT_data_member_location: 28
        DIE    0: DW_TAG_member (0x7f145701beb0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mmap_length"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 170
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 44
        DIE    0: DW_TAG_member (0x7f145701bf00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "mmap_addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 171
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 48
        DIE    0: DW_TAG_member (0x7f145701bf50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "drives_length"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 174
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 52
        DIE    0: DW_TAG_member (0x7f145701bfa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "drives_addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 175
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 56
        DIE    0: DW_TAG_member (0x7f1457021000)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "config_table"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 178
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 60
        DIE    0: DW_TAG_member (0x7f1457021050)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "boot_loader_name"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 181
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 64
        DIE    0: DW_TAG_member (0x7f14570210a0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "apm_table"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 184
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 68
        DIE    0: DW_TAG_member (0x7f14570210f0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_control_info"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 187
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 72
        DIE    0: DW_TAG_member (0x7f1457021140)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_mode_info"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 188
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 76
        DIE    0: DW_TAG_member (0x7f1457021190)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_mode"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 189
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ec30)
          DW_AT_data_member_location: 80
        DIE    0: DW_TAG_member (0x7f14570211e0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_interface_seg"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 190
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ec30)
          DW_AT_data_member_location: 82
        DIE    0: DW_TAG_member (0x7f1457021230)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_interface_off"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 191
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ec30)
          DW_AT_data_member_location: 84
        DIE    0: DW_TAG_member (0x7f1457021280)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "vbe_interface_len"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 192
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ec30)
          DW_AT_data_member_location: 86
        DIE    0: DW_TAG_member (0x7f14570212d0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_addr"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 194
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ed70)
          DW_AT_data_member_location: 88
        DIE    0: DW_TAG_member (0x7f1457021320)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_pitch"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 195
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 96
        DIE    0: DW_TAG_member (0x7f1457021370)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_width"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 196
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 100
        DIE    0: DW_TAG_member (0x7f14570213c0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_height"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 197
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 104
        DIE    0: DW_TAG_member (0x7f1457021410)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_bpp"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 198
          DW_AT_decl_column: 21
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 108
        DIE    0: DW_TAG_member (0x7f1457021460)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "framebuffer_type"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 202
          DW_AT_decl_column: 21
          DW_AT_type: die -> 0 (0x7f145700eb90)
          DW_AT_data_member_location: 109
        DIE    0: DW_TAG_member (0x7f14570214b0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f145701baf0)
          DW_AT_data_member_location: 112
    DIE    0: DW_TAG_typedef (0x7f1457021550)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_info_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 221
      DW_AT_decl_column: 31
      DW_AT_type: die -> 0 (0x7f145701bbe0)
    DIE    0: DW_TAG_structure_type (0x7f14570219b0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_mmap_entry"
      DW_AT_byte_size: 24
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 230
      DW_AT_decl_column: 8
        DIE    0: DW_TAG_member (0x7f1457021a00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "size"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 232
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7f1457021a50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "addr_low"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 233
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 4
        DIE    0: DW_TAG_member (0x7f1457021aa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "addr_high"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 234
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 8
        DIE    0: DW_TAG_member (0x7f1457021af0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "len_low"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 235
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 12
        DIE    0: DW_TAG_member (0x7f1457021b40)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "len_high"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 236
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 16
        DIE    0: DW_TAG_member (0x7f1457021b90)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "type"
          DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
          DW_AT_decl_line: 244
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7f145700ecd0)
          DW_AT_data_member_location: 20
    DIE    0: DW_TAG_typedef (0x7f1457021c30)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "multiboot_memory_map_t"
      DW_AT_decl_file: "/usr/local/osdev/versions/v/kernel/include/multiboot.h" (0)
      DW_AT_decl_line: 246
      DW_AT_decl_column: 37
      DW_AT_type: die -> 0 (0x7f14570219b0)
    DIE    0: DW_TAG_variable (0x7f1457028910)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_kernel_end"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 8
      DW_AT_decl_column: 17
      DW_AT_type: die -> 0 (0x7f1456f8b230)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_variable (0x7f1457028aa0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "paging_pdpt"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 11
      DW_AT_decl_column: 31
      DW_AT_type: die -> 0 (0x7f1456fff1e0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_variable (0x7f1457028b40)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "paging_pd"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 12
      DW_AT_decl_column: 31
      DW_AT_type: die -> 0 (0x7f1456fff1e0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_variable (0x7f1457028be0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "vv_magic_word"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 14
      DW_AT_decl_column: 21
      DW_AT_type: die -> 0 (0x7f1457006870)
      DW_AT_location: location descriptor:
        (0x7f1457078140) DW_OP_addr address, 0

    DIE    0: DW_TAG_variable (0x7f1457028c80)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "physical_memory_base"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 15
      DW_AT_decl_column: 12
      DW_AT_type: die -> 0 (0x7f1456ff8c80)
      DW_AT_external: 1
      DW_AT_location: location descriptor:
        (0x7f1457078190) DW_OP_addr address, 0

    DIE    0: DW_TAG_variable (0x7f1457028d20)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "phsyical_memory_top"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 16
      DW_AT_decl_column: 12
      DW_AT_type: die -> 0 (0x7f1456ff8c80)
      DW_AT_external: 1
      DW_AT_location: location descriptor:
        (0x7f14570781e0) DW_OP_addr address, 0

    DIE    0: DW_TAG_variable (0x7f1457028dc0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "kernel_virtual_memory_base"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 17
      DW_AT_decl_column: 12
      DW_AT_type: die -> 0 (0x7f1456ff8c80)
      DW_AT_external: 1
      DW_AT_location: location descriptor:
        (0x7f1457078230) DW_OP_addr address, 0

    DIE    0: DW_TAG_variable (0x7f1457028e60)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "kernel_virtual_memory_top"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 18
      DW_AT_decl_column: 12
      DW_AT_type: die -> 0 (0x7f1456ff8c80)
      DW_AT_external: 1
      DW_AT_location: location descriptor:
        (0x7f1457078280) DW_OP_addr address, 0

    DIE    0: DW_TAG_array_type (0x7f1457028f50)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7f1456fc84b0)
        DIE    0: DW_TAG_subrange_type (0x7f1457028fa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7f1456f79a50)
          DW_AT_upper_bound: 1023
    DIE    0: DW_TAG_variable (0x7f1457032000)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "second_page_table"
      DW_AT_decl_file: "kernel/c/memory.c" (1)
      DW_AT_decl_line: 20
      DW_AT_decl_column: 22
      DW_AT_type: die -> 0 (0x7f1457028f50)
      DW_AT_external: 1
      DW_AT_alignment: 4096
      DW_AT_location: location descriptor:
        (0x7f14570782d0) DW_OP_addr address, 0

    DIE    0: DW_TAG_variable (0x7f14570320a0)
      abbrev id: 0 offset: 0 mark: 0
